Тест_ЗУП_31_КОРП/src/Catalogs/МероприятияОценкиПерсонала/МероприятияОценкиПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МероприятияОценкиПерсонала</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонАнкеты</name>
    <type>
      <types>CatalogRef.ШаблоныАнкет</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполненияРеспондентов</name>
    <type>
      <types>EnumRef.СпособЗаполненияРеспондентовВОценке360</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтактнойИнформацииРеспонденты</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтактнойИнформацииСотрудники</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьШаблонСообщения</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьВопросыКомпетенций</name>
    <attributes>
      <name>Компетенция</name>
      <type>
        <types>CatalogRef.КомпетенцииПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВопросыХарактеристик</name>
    <attributes>
      <name>ХарактеристикаПерсонала</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеОпроса</name>
      <type>
        <types>DocumentRef.НазначениеОпросов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеспондентыЕдиныйНабор</name>
    <attributes>
      <name>Респондент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РольРеспондента</name>
      <type>
        <types>CatalogRef.РолиРеспондентаОценкиПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Респонденты</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Респондент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РольРеспондента</name>
      <type>
        <types>CatalogRef.РолиРеспондентаОценкиПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/ПодразделенияОрганизаций/ПодразделенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодразделенияОрганизаций</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочиванияИерархического</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТерриториальныеУсловияПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.УдалитьТерриториальныеУсловияПФР</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыСотрудников</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетНомерТерриториальногоОрганаРосстата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТерриториальногоОрганаРосстата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСевернойНадбавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКоличествоДополнительныхДнейОтпускаВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаФСГС</name>
    <comment>Код органа Федеральной службы государственной статистики</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗависимыеСтажи</name>
    <attributes>
      <name>ВидСтажа</name>
      <type>
        <types>CatalogRef.ВидыСтажа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/РолиРеспондентаОценкиПерсонала/РолиРеспондентаОценкиПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиРеспондентаОценкиПерсонала</name>
  <predefined>
    <items>
      <name>Клиент</name>
      <description>Клиент</description>
    </items>
    <items>
      <name>Коллега</name>
      <description>Коллега</description>
    </items>
    <items>
      <name>Подчиненный</name>
      <description>Подчиненный</description>
    </items>
    <items>
      <name>Руководитель</name>
      <description>Руководитель</description>
    </items>
    <items>
      <name>Самооценка</name>
      <description>Самооценка</description>
    </items>
  </predefined>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/МероприятияОценкиПерсонала/Forms/ФормаЗаполненияРеспондентов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Участники.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресСотрудниковВХранилище));
	
	ВключатьРольКоллега = Истина;
	ВключатьРольСамооценка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьСвойстваПоляВводаПоИспользованию("КоличествоРеспондентовСотрудника", ОграничиватьКоличествоРеспондентовСотрудника);
	УстановитьСвойстваПоляВводаПоИспользованию("КоличествоСотрудниковРеспондента", ОграничиватьКоличествоСотрудниковРеспондента);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура СформироватьТаблицуРеспондентовЗакрытьФорму(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;	
	
	АдресРеспондентовВХранилище = ТаблицаРеспондентовИндивидуальныйНабор();
	
	Закрыть(АдресРеспондентовВХранилище);
	
КонецПроцедуры

#КонецОбласти  

#Область ПроцедурыИФункцииОсновнойФункциональности

&НаСервере
Функция ТаблицаРеспондентовИндивидуальныйНабор()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Участники", Участники.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Участники.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ Участники
	|ИЗ
	|	&Участники КАК Участники";
	
	Запрос.Выполнить();
	
	ОписательВТ = КадровыйУчет.ОписаниеВременнойТаблицыОтборовФизическихЛиц("Участники");
	
	КадровыйУчет.СоздатьВТТекущиеКадровыеДанныеСотрудниковФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц, ОписательВТ, Истина, , "ТекущееПодразделение,ДатаУвольнения", "ВТТекущиеКадровыеДанныеСотрудников");

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(Участники.ФизическоеЛицо, Сотрудники.ФизическоеЛицо) КАК ФизическоеЛицо,
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Участники.ФизическоеЛицо В
	|				(ВЫБРАТЬ
	|					Участники.ФизическоеЛицо
	|				ИЗ
	|					Участники)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЯвляетсяОцениваемым
	|ПОМЕСТИТЬ Сотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ПО (ТекущиеКадровыеДанныеСотрудников.Сотрудник = Сотрудники.Ссылка)
	|			И (ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
	|		ПОЛНОЕ СОЕДИНЕНИЕ Участники КАК Участники
	|		ПО Сотрудники.ФизическоеЛицо = Участники.ФизическоеЛицо
	|ГДЕ
	|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	2 КАК Приоритет,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Самооценка.ФизическоеЛицо КАК Респондент,
	|	&РольСамооценка КАК РольРеспондента
	|ПОМЕСТИТЬ Респонденты
	|ИЗ
	|	Сотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Сотрудники КАК Самооценка
	|		ПО Сотрудники.ФизическоеЛицо = Самооценка.ФизическоеЛицо
	|			И (Сотрудники.ЯвляетсяОцениваемым)
	|ГДЕ
	|	&ВключатьРольСамооценка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	3,
	|	Сотрудники.ФизическоеЛицо,
	|	Коллега.ФизическоеЛицо,
	|	&РольКоллега
	|ИЗ
	|	Сотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Сотрудники КАК Коллега
	|		ПО Сотрудники.ФизическоеЛицо <> Коллега.ФизическоеЛицо
	|			И Сотрудники.Подразделение = Коллега.Подразделение
	|			И (Сотрудники.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))
	|			И (Сотрудники.ЯвляетсяОцениваемым)
	|ГДЕ
	|	&ВключатьРольКоллега
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Респонденты.Респондент КАК Респондент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Респонденты.ФизическоеЛицо) КАК КоличествоОцениваемых
	|ПОМЕСТИТЬ СтатистикаРеспондентов
	|ИЗ
	|	Респонденты КАК Респонденты
	|
	|СГРУППИРОВАТЬ ПО
	|	Респонденты.Респондент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Респонденты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Респонденты.Респондент КАК Респондент,
	|	Респонденты.РольРеспондента КАК РольРеспондента,
	|	СтатистикаРеспондентов.КоличествоОцениваемых КАК КоличествоОцениваемых,
	|	Респонденты.Приоритет КАК Приоритет
	|ИЗ
	|	Респонденты КАК Респонденты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатистикаРеспондентов КАК СтатистикаРеспондентов
	|		ПО Респонденты.Респондент = СтатистикаРеспондентов.Респондент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Респонденты.ФизическоеЛицо,
	|	Респонденты.Приоритет,
	|	СтатистикаРеспондентов.КоличествоОцениваемых
	|ИТОГИ ПО
	|	ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ВключатьРольКоллега", ВключатьРольКоллега);
	Запрос.УстановитьПараметр("ВключатьРольСамооценка",	ВключатьРольСамооценка);
	Запрос.УстановитьПараметр("РольСамооценка",
		ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.РолиРеспондентаОценкиПерсонала.Самооценка"));
	Запрос.УстановитьПараметр("РольКоллега",
		ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.РолиРеспондентаОценкиПерсонала.Коллега"));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПоФизлицам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаРеспондентов = Новый ТаблицаЗначений;
	ТаблицаРеспондентов.Колонки.Добавить("ФизическоеЛицо",		Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаРеспондентов.Колонки.Добавить("Респондент", 			Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаРеспондентов.Колонки.Добавить("РольРеспондента", 	Новый ОписаниеТипов("СправочникСсылка.РолиРеспондентаОценкиПерсонала"));
	
	КоличествоСотрудниковРеспондентов = Новый Соответствие;
	
	Пока ВыборкаПоФизлицам.Следующий() Цикл
		КоличествоРеспондентов = 0;
		ВыборкаРеспондентов = ВыборкаПоФизлицам.Выбрать();
		Пока ВыборкаРеспондентов.Следующий() Цикл
			
			КоличествоСотрудников = КоличествоСотрудниковРеспондентов[ВыборкаРеспондентов.Респондент];
			Если КоличествоСотрудников = Неопределено Тогда
				КоличествоСотрудников = 0;
			КонецЕсли;
			
			Если ОграничиватьКоличествоРеспондентовСотрудника И КоличествоРеспондентов = КоличествоРеспондентовСотрудника Тогда
				// переходим к следующему сотруднику
				Прервать;
			КонецЕсли;
			
			Если ОграничиватьКоличествоСотрудниковРеспондента И КоличествоСотрудников = КоличествоСотрудниковРеспондента Тогда
				// переходим к следующему респонденту
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ТаблицаРеспондентов.Добавить(), ВыборкаРеспондентов);
				
			// считаем респондентов сотрудника
			КоличествоРеспондентов = КоличествоРеспондентов + 1;
		
			// считаем сотрудников респондента
			КоличествоСотрудников = КоличествоСотрудников + 1;
			КоличествоСотрудниковРеспондентов.Вставить(ВыборкаРеспондентов.Респондент, КоличествоСотрудников);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаРеспондентов,Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовФормы


&НаКлиенте
Процедура УстановитьСвойстваПоляВводаПоИспользованию(ИмяПоля, Использование)
	
	Элементы[ИмяПоля].Доступность = Использование;
	Элементы[ИмяПоля].АвтоОтметкаНезаполненного = Использование;
	Элементы[ИмяПоля].ОтметкаНезаполненного = Использование;
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьКоличествоРеспондентовСотрудникаПриИзменении(Элемент)
	
	УстановитьСвойстваПоляВводаПоИспользованию("КоличествоРеспондентовСотрудника", ОграничиватьКоличествоРеспондентовСотрудника);
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьКоличествоСотрудниковРеспондентаПриИзменении(Элемент)
	
	УстановитьСвойстваПоляВводаПоИспользованию("КоличествоСотрудниковРеспондента", ОграничиватьКоличествоСотрудниковРеспондента);
	
КонецПроцедуры

#КонецОбласти
